{"@context":{"@language":"en","@vocab":"https://schema.org/","citeAs":"cr:citeAs","column":"cr:column","conformsTo":"dct:conformsTo","cr":"http://mlcommons.org/croissant/","data":{"@id":"cr:data","@type":"@json"},"dataBiases":"cr:dataBiases","dataCollection":"cr:dataCollection","dataType":{"@id":"cr:dataType","@type":"@vocab"},"dct":"http://purl.org/dc/terms/","extract":"cr:extract","field":"cr:field","fileProperty":"cr:fileProperty","fileObject":"cr:fileObject","fileSet":"cr:fileSet","format":"cr:format","includes":"cr:includes","isEnumeration":"cr:isEnumeration","isLiveDataset":"cr:isLiveDataset","jsonPath":"cr:jsonPath","key":"cr:key","md5":"cr:md5","parentField":"cr:parentField","path":"cr:path","personalSensitiveInformation":"cr:personalSensitiveInformation","recordSet":"cr:recordSet","references":"cr:references","regex":"cr:regex","repeated":"cr:repeated","replace":"cr:replace","sc":"https://schema.org/","separator":"cr:separator","source":"cr:source","subField":"cr:subField","transform":"cr:transform","wd":"https://www.wikidata.org/wiki/"},"alternateName":"Loan Approval Data Set","citeAs":"10.34740/kaggle/dsv/5149638","conformsTo":"http://mlcommons.org/croissant/1.0","license":{"@type":"sc:CreativeWork","name":"Other (specified in description)"},"distribution":[{"contentUrl":"https://www.kaggle.com/api/v1/datasets/download/mirzahasnine/loan-data-set?datasetVersionNumber=1","contentSize":"10.909 KB","md5":"eVNyhdJyrAfhy3NuOk\u002Bw3w==","encodingFormat":"application/zip","@id":"archive.zip","@type":"cr:FileObject","name":"archive.zip","description":"Archive containing all the contents of the Loan Data Set dataset"},{"contentUrl":"loan_test.csv","containedIn":{"@id":"archive.zip"},"encodingFormat":"text/csv","@id":"loan_test.csv_fileobject","@type":"cr:FileObject","name":"loan_test.csv","description":"Loan approval process"},{"contentUrl":"loan_train.csv","containedIn":{"@id":"archive.zip"},"encodingFormat":"text/csv","@id":"loan_train.csv_fileobject","@type":"cr:FileObject","name":"loan_train.csv"}],"recordSet":[{"field":[{"dataType":["sc:Text"],"source":{"fileObject":{"@id":"loan_test.csv_fileobject"},"extract":{"column":"Gender"}},"@id":"loan_test.csv/Gender","@type":"cr:Field","name":"Gender","description":""},{"dataType":["sc:Boolean"],"source":{"fileObject":{"@id":"loan_test.csv_fileobject"},"extract":{"column":"Married"}},"@id":"loan_test.csv/Married","@type":"cr:Field","name":"Married","description":""},{"dataType":["sc:Text"],"source":{"fileObject":{"@id":"loan_test.csv_fileobject"},"extract":{"column":"Dependents"}},"@id":"loan_test.csv/Dependents","@type":"cr:Field","name":"Dependents","description":""},{"dataType":["sc:Text"],"source":{"fileObject":{"@id":"loan_test.csv_fileobject"},"extract":{"column":"Education"}},"@id":"loan_test.csv/Education","@type":"cr:Field","name":"Education","description":""},{"dataType":["sc:Boolean"],"source":{"fileObject":{"@id":"loan_test.csv_fileobject"},"extract":{"column":"Self_Employed"}},"@id":"loan_test.csv/Self_Employed","@type":"cr:Field","name":"Self_Employed","description":""},{"dataType":["sc:Integer"],"source":{"fileObject":{"@id":"loan_test.csv_fileobject"},"extract":{"column":"Applicant_Income"}},"@id":"loan_test.csv/Applicant_Income","@type":"cr:Field","name":"Applicant_Income","description":""},{"dataType":["sc:Integer"],"source":{"fileObject":{"@id":"loan_test.csv_fileobject"},"extract":{"column":"Coapplicant_Income"}},"@id":"loan_test.csv/Coapplicant_Income","@type":"cr:Field","name":"Coapplicant_Income","description":""},{"dataType":["sc:Integer"],"source":{"fileObject":{"@id":"loan_test.csv_fileobject"},"extract":{"column":"Loan_Amount"}},"@id":"loan_test.csv/Loan_Amount","@type":"cr:Field","name":"Loan_Amount","description":""},{"dataType":["sc:Integer"],"source":{"fileObject":{"@id":"loan_test.csv_fileobject"},"extract":{"column":"Term"}},"@id":"loan_test.csv/Term","@type":"cr:Field","name":"Term","description":""},{"dataType":["sc:Integer"],"source":{"fileObject":{"@id":"loan_test.csv_fileobject"},"extract":{"column":"Credit_History"}},"@id":"loan_test.csv/Credit_History","@type":"cr:Field","name":"Credit_History","description":""},{"dataType":["sc:Text"],"source":{"fileObject":{"@id":"loan_test.csv_fileobject"},"extract":{"column":"Area"}},"@id":"loan_test.csv/Area","@type":"cr:Field","name":"Area"}],"@id":"loan_test.csv","@type":"cr:RecordSet","name":"loan_test.csv","description":"Loan approval process"},{"field":[{"dataType":["sc:Text"],"source":{"fileObject":{"@id":"loan_train.csv_fileobject"},"extract":{"column":"Gender"}},"@id":"loan_train.csv/Gender","@type":"cr:Field","name":"Gender"},{"dataType":["sc:Boolean"],"source":{"fileObject":{"@id":"loan_train.csv_fileobject"},"extract":{"column":"Married"}},"@id":"loan_train.csv/Married","@type":"cr:Field","name":"Married"},{"dataType":["sc:Text"],"source":{"fileObject":{"@id":"loan_train.csv_fileobject"},"extract":{"column":"Dependents"}},"@id":"loan_train.csv/Dependents","@type":"cr:Field","name":"Dependents"},{"dataType":["sc:Text"],"source":{"fileObject":{"@id":"loan_train.csv_fileobject"},"extract":{"column":"Education"}},"@id":"loan_train.csv/Education","@type":"cr:Field","name":"Education"},{"dataType":["sc:Boolean"],"source":{"fileObject":{"@id":"loan_train.csv_fileobject"},"extract":{"column":"Self_Employed"}},"@id":"loan_train.csv/Self_Employed","@type":"cr:Field","name":"Self_Employed"},{"dataType":["sc:Integer"],"source":{"fileObject":{"@id":"loan_train.csv_fileobject"},"extract":{"column":"Applicant_Income"}},"@id":"loan_train.csv/Applicant_Income","@type":"cr:Field","name":"Applicant_Income"},{"dataType":["sc:Float"],"source":{"fileObject":{"@id":"loan_train.csv_fileobject"},"extract":{"column":"Coapplicant_Income"}},"@id":"loan_train.csv/Coapplicant_Income","@type":"cr:Field","name":"Coapplicant_Income"},{"dataType":["sc:Integer"],"source":{"fileObject":{"@id":"loan_train.csv_fileobject"},"extract":{"column":"Loan_Amount"}},"@id":"loan_train.csv/Loan_Amount","@type":"cr:Field","name":"Loan_Amount"},{"dataType":["sc:Integer"],"source":{"fileObject":{"@id":"loan_train.csv_fileobject"},"extract":{"column":"Term"}},"@id":"loan_train.csv/Term","@type":"cr:Field","name":"Term"},{"dataType":["sc:Integer"],"source":{"fileObject":{"@id":"loan_train.csv_fileobject"},"extract":{"column":"Credit_History"}},"@id":"loan_train.csv/Credit_History","@type":"cr:Field","name":"Credit_History"},{"dataType":["sc:Text"],"source":{"fileObject":{"@id":"loan_train.csv_fileobject"},"extract":{"column":"Area"}},"@id":"loan_train.csv/Area","@type":"cr:Field","name":"Area"},{"dataType":["sc:Boolean"],"source":{"fileObject":{"@id":"loan_train.csv_fileobject"},"extract":{"column":"Status"}},"@id":"loan_train.csv/Status","@type":"cr:Field","name":"Status"}],"@id":"loan_train.csv","@type":"cr:RecordSet","name":"loan_train.csv"}],"version":1,"keywords":["packages \u003E pandas","packages \u003E matplotlib","packages \u003E plotly","task \u003E classification"],"identifier":"10.34740/kaggle/dsv/5149638","isAccessibleForFree":true,"includedInDataCatalog":{"@type":"sc:DataCatalog","name":"Kaggle","url":"https://www.kaggle.com"},"creator":{"@type":"sc:Person","name":"Mirza_Hasnine","url":"/mirzahasnine","image":"https://storage.googleapis.com/kaggle-avatars/thumbnails/7826025-kg.jpeg"},"publisher":{"@type":"sc:Organization","name":"Kaggle","url":"https://www.kaggle.com/organizations/kaggle","image":"https://storage.googleapis.com/kaggle-organizations/4/thumbnail.png"},"thumbnailUrl":"https://storage.googleapis.com/kaggle-datasets-images/2991957/5149638/2df32833b4ab8ee552a5178dca0715c1/dataset-card.jpg?t=2023-03-12-05-05-43","dateModified":"2023-03-12T05:02:43.5","datePublished":"2023-03-12T05:03:24.6275997","@type":"sc:Dataset","name":"Loan Data Set","url":"https://www.kaggle.com/datasets/mirzahasnine/loan-data-set/versions/1","description":"What Is a Loan?\nThe term loan refers to a type of credit vehicle in which a sum of money is lent to another party in exchange for future repayment of the value or principal amount. In many cases, the lender also adds interest or finance charges to the principal value which the borrower must repay in addition to the principal balance.\n\nLoans may be for a specific, one-time amount, or they may be available as an open-ended line of credit up to a specified limit. Loans come in many different forms including secured, unsecured, commercial, and personal loans.\n\nKEY TAKEAWAYS\nA loan is when money is given to another party in exchange for repayment of the loan principal amount plus interest.\nLenders will consider a prospective borrower\u0027s income, credit score, and debt levels before deciding to offer them a loan.\nA loan may be secured by collateral such as a mortgage or it may be unsecured such as a credit card.\nRevolving loans or lines can be spent, repaid, and spent again, while term loans are fixed-rate, fixed-payment loans.\n\nLoan\nUnderstanding Loans\nA loan is a form of debt incurred by an individual or other entity. The lender—usually a corporation, financial institution, or government—advances a sum of money to the borrower. In return, the borrower agrees to a certain set of terms including any finance charges, interest, repayment date, and other conditions.\n\n\nIn some cases, the lender may require collateral to secure the loan and ensure repayment. Loans may also take the form of bonds and certificates of deposit (CDs). It is also possible to take a loan from a 401(k) account.\n\nThe Loan Process\nHere\u0027s how the loan process works. When someone needs money, they apply for a loan from a bank, corporation, government, or other entity. The borrower may be required to provide specific details such as the reason for the loan, their financial history, Social Security Number (SSN), and other information. The lender reviews the information including a person\u0027s debt-to-income (DTI) ratio to see if the loan can be paid back.\n\nBased on the applicant\u0027s creditworthiness, the lender either denies or approves the application. The lender must provide a reason should the loan application be denied. If the application is approved, both parties sign a contract that outlines the details of the agreement. The lender advances the proceeds of the loan, after which the borrower must repay the amount including any additional charges such as interest.\n\nThe terms of a loan are agreed to by each party before any money or property changes hands or is disbursed. If the lender requires collateral, the lender outlines this in the loan documents. Most loans also have provisions regarding the maximum amount of interest, as well as other covenants such as the length of time before repayment is required.\n\nWhy Are Loans Used?\nLoans are advanced for a number of reasons including major purchases, investing, renovations, debt consolidation, and business ventures. Loans also help existing companies expand their operations. Loans allow for growth in the overall money supply in an economy and open up competition by lending to new businesses.\n\nThe interest and fees from loans are a primary source of revenue for many banks, as well as some retailers through the use of credit facilities and credit cards.\n\nComponents of a Loan\nThere are several important terms that determine the size of a loan and how quickly the borrower can pay it back:\n\nPrincipal: This is the original amount of money that is being borrowed.\nLoan Term: The amount of time that the borrower has to repay the loan.\nInterest Rate: The rate at which the amount of money owed increases, usually expressed in terms of an annual percentage rate (APR).\nLoan Payments: The amount of money that must be paid every month or week in order to satisfy the terms of the loan. Based on the principal, loan term, and interest rate, this can be determined from an amortization table.\nIn addition, the lender may also tack on additional fees, such as an origination fee, servicing fee, or late payment fees. For larger loans, they may also require collateral, such as real estate or a vehicle. If the borrower defaults on the loan, these assets may be seized to pay off the remaining debt.\nTips on Getting a Loan\nIn order to qualify for a loan, prospective borrowers need to show that they have the ability and financial discipline to repay the lender. There are several factors that lenders consider when deciding if a particular borrower is worth the risk:\n\nIncome: For larger loans, lenders may require a certain income threshold, thereby ensuring that the borrower will have no trouble making payments. They may also require several years of stable employment, especially in the case of home mortgages.\nCredit Score: A credit score is a numerical representation of a person\u0027s creditworthiness, based on their history of borrowing and repayment. Missed payments and bankruptcies can cause serious damage to a person\u0027s credit score.\nDebt-to-Income Ratio: In addition to one\u0027s income, lenders also check the borrower\u0027s credit history to check how many active loans they have at the same time. A high level of debt indicates that the borrower may have difficulty repaying their debts.\nIn order to increase the chance of qualifying for a loan, it is important to demonstrate that you can use debt responsibly. Pay off your loans and credit cards promptly, and avoid assuming any unnecessary debt. This will also qualify you for lower interest rates.\n\nIt is still possible to qualify for loans if you have a lot of debt or a poor credit score, but these will likely come with a higher interest rate. Since these loans are much more expensive in the long run, you are much better off trying to improve your credit scores and debt-income ratio.\nRelationship Between Interest Rates and Loans\nInterest rates have a significant effect on loans and the ultimate cost to the borrower. Loans with higher interest rates have higher monthly payments—or take longer to pay off—than loans with lower interest rates. For example, \n\n Higher interest rates come with higher monthly payments, meaning they take longer to pay off than loans with lower rates.\n\nSimple vs. Compound Interest\nThe interest rate on loans can be set at simple or compound interest. Simple interest is interest on the principal loan. Banks almost never charge borrowers simple interest. For example, let\u0027s say an individual takes out a $300,000 mortgage from the bank, and the loan agreement stipulates that the interest rate on the loan is 15% annually. As a result, the borrower will have to pay the bank a total of $345,000 or $300,000 x 1.15.\n\nCompound interest is interest on interest, and that means more money in interest has to be paid by the borrower. The interest is not only applied to the principal but also the accumulated interest of previous periods. The bank assumes that at the end of the first year, the borrower owes it the principal plus interest for that year. At the end of the second year, the borrower owes it the principal and the interest for the first year plus the interest on interest for the first year.\n\nWith compounding, the interest owed is higher than that of the simple interest method because interest is charged monthly on the principal loan amount, including accrued interest from the previous months. For shorter time frames, the calculation of interest is similar for both methods. As the lending time increases, the disparity between the two types of interest calculations grows.\n\nIf you\u0027re looking to take out a loan to pay for personal expenses, then a personal loan calculator can help you find the interest rate that best suits your needs.\n\nTypes of Loans\nLoans come in many different forms. There are a number of factors that can differentiate the costs associated with them along with their contractual terms.\n\nSecured vs. Unsecured Loan\nLoans can be secured or unsecured. Mortgages and car loans are secured loans, as they are both backed or secured by collateral. In these cases, the collateral is the asset for which the loan is taken out, so the collateral for a mortgage is the home, while the vehicle secures a car loan. Borrowers may be required to put up other forms of collateral for other types of secured loans if required.\n\nCredit cards and signature loans are unsecured loans. This means they are not backed by any collateral. Unsecured loans usually have higher interest rates than secured loans because the risk of default is higher than secured loans. That\u0027s because the lender of a secured loan can repossess the collateral if the borrower defaults. Rates tend to vary wildly on unsecured loans depending on multiple factors including the borrower\u0027s credit history.\n\nRevolving vs. Term Loan\nLoans can also be described as revolving or term. A revolving loan can be spent, repaid, and spent again, while a term loan refers to a loan paid off in equal monthly installments over a set period. A credit card is an unsecured, revolving loan, while a home equity line of credit (HELOC) is a secured, revolving loan. In contrast, a car loan is a secured, term loan, and a signature loan is an unsecured, term loan.\n\nWhat Is a Loan Shark?\nA loan shark is a slang term for predatory lenders who give informal loans at extremely high interest rates, often to people with little credit or collateral. Because these loan terms may not be legally enforceable, loan sharks have sometimes resorted to intimidation or violence in order to ensure repayment.\n\nHow Can You Reduce Your Total Loan Cost?\nThe best way to reduce your total loan cost is to pay more than the minimum payment whenever possible. This reduces the amount of interest that accumulates, eventually allowing you to pay off the loan early. Be warned, however, that some loans may have early pre-payment penalties.\n\nHow Do You Become a Loan Officer?\nA loan officer is a bank employee who is responsible for approving mortgages, car loans, and other loans. Each state has different licensing requirements, but the standard is at least 20 hours of pre-licensing classes.\n\nIn addition, mortgage loan officers must pass the NMLS National Test, as well as a criminal background check and credit check. Commercial loan officers have fewer requirements, but their employers may still require additional credentials.\n\nThe Bottom Line\nLoans are one of the basic building blocks of the financial economy. By giving out money with interest, lenders are able to provide funding for economic activity while being compensated for their risk. From small personal loans to billion-dollar corporate debts, lending money is an essential function of the modern economy.\n"}
